In [1]:
import pandas as pd

In [2]:
cars = pd.read_csv("cars.csv")

In [3]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

Check for all elements in the column "origin" whether they are equal to "europe". Save the boolean Series in the variable mask1

In [4]:
mask1 = cars.origin == 'europe'
mask1

0      False
1      False
2      False
3      False
4      False
       ...
393    False
394     True
395    False
396    False
397    False
Name: origin, Length: 398, dtype: bool


Check for all elements in the column "mpg" whether they are smaller than 20. Save the boolean Series in the variable mask2

In [6]:
mask2 = cars.mpg < 20
mask2

0       True
1       True
2       True
3       True
4       True
       ...
393    False
394    False
395    False
396    False
397    False
Name: mpg, Length: 398, dtype: bool

Filter the cars DataFrame for all cars from europe (use mask1) and save the subset in the variable europe

In [9]:
europe = cars.loc[mask1].copy()

Inspect! What is the name of the second car

In [12]:
europe.iloc[1].loc['name']

'peugeot 504'

Get some meta information on the DataFrame europe. How many cars are from europe

In [13]:
europe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70 entries, 19 to 394
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           70 non-null     float64
 1   cylinders     70 non-null     int64
 2   displacement  70 non-null     float64
 3   horsepower    68 non-null     float64
 4   weight        70 non-null     int64
 5   acceleration  70 non-null     float64
 6   model_year    70 non-null     int64
 7   origin        70 non-null     object
 8   name          70 non-null     object
dtypes: float64(4), int64(3), object(2)
memory usage: 5.5+ KB

Filter the DataFrame cars for all cars from europe with low fuel efficiency (mpg lower than 20). Use mask1 and mask2!
Save the subset in the variable europe_le

In [14]:
europe_le = cars.loc[(mask1 & mask2)].copy()

In [15]:
europe_le

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
76,18.0,4,121.0,112.0,2933,14.5,72,europe,volvo 145e (sw)
120,19.0,4,121.0,112.0,2868,15.5,73,europe,volvo 144ea
209,19.0,4,120.0,88.0,3270,21.9,76,europe,peugeot 504
211,16.5,6,168.0,120.0,3820,16.7,76,europe,mercedes-benz 280s
275,17.0,6,163.0,125.0,3140,13.6,78,europe,volvo 264gl
277,16.2,6,163.0,133.0,3410,15.8,78,europe,peugeot 604sl

Filter the DataFrame cars for all cars with an mpg between 10 and 15 (both ends inclusive!).
Save the subset in the variable mpg_10_15

In [21]:
mpg_10_15 = cars.loc[cars.mpg.between(10,15, inclusive = True)].copy()

In [22]:
mpg_10_15.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
5,15.0,8,429.0,198.0,4341,10.0,70,usa,ford galaxie 500
6,14.0,8,454.0,220.0,4354,9.0,70,usa,chevrolet impala
7,14.0,8,440.0,215.0,4312,8.5,70,usa,plymouth fury iii
8,14.0,8,455.0,225.0,4425,10.0,70,usa,pontiac catalina

Filter the Dataframe cars for all cars that are not built in the years 73 and 74, and only the columns "mpg" and "name"!
Save the subset in the variable not_73_74

In [25]:
not_73_74 = cars.loc[~cars.model_year.isin([73,74]),['mpg','name']].copy()

In [26]:
not_73_74.head()

    mpg                       name
0  18.0  chevrolet chevelle malibu
1  15.0          buick skylark 320
2  18.0         plymouth satellite
3  16.0              amc rebel sst
4  17.0                ford torino


Drop the columns "displacement" and "cylinders" from the DataFrame cars! Save the change

In [28]:
cars.drop(['displacement','cylinders'],axis = 1,inplace = True)

In [29]:
cars.head()

,mpg,horsepower,weight,acceleration,model_year,origin,name
0,18.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,140.0,3449,10.5,70,usa,ford torino

Drop all rows/cars from "usa" from the DataFrame cars! Use the loc operator and overwrite cars

In [31]:
cars = cars.loc[cars.origin != 'usa']


Add the new column "l_per_100km" to the DataFrame cars by calculating 235.21/mpg. Round to 2 decimals

In [34]:
cars['l_per_100'] = (235.21/cars.mpg).round(2)

C:\Users\shiv\miniconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [35]:
cars

,mpg,horsepower,weight,acceleration,model_year,origin,name,l_per_100
14,24.0,95.0,2372,15.0,70,japan,toyota corona mark ii,9.80
18,27.0,88.0,2130,14.5,70,japan,datsun pl510,8.71
19,26.0,46.0,1835,20.5,70,europe,vw 1131 deluxe sedan,9.05
20,25.0,87.0,2672,17.5,70,europe,peugeot 504,9.41
21,24.0,90.0,2430,14.5,70,europe,audi 100 ls,9.80
...,...,...,...,...,...,...,...,...
383,38.0,67.0,1965,15.0,82,japan,honda civic,6.19
384,32.0,67.0,1965,15.7,82,japan,honda civic (auto),7.35
385,38.0,67.0,1995,16.2,82,japan,datsun 310 gx,6.19
390,32.0,96.0,2665,13.9,82,japan,toyota celica gt,7.35
394,44.0,52.0,2130,24.6,82,europe,vw pickup,5.35